//======================================================================
//文件名称：DS_CO2_20.h
//功能概要：CO2传感器DS_CO2_20构件头文件
//制作单位：福建农林大学物联网与嵌入式实验室
//更新记录：2017-11-19 V1.0
//======================================================================

#ifndef _DS_CO2_20_H
#define _DS_CO2_20_H

#include <iocc2530.h>
#include <hal_uart.h>
#include <stdio.h>

//引脚定义
#define DS_CO2_20_RST	P0_4
#define DS_CO2_20_BAUD	9600

//命令定义
#define DS_CO2_20_CMD_PSSTIVEREAD			0xE3

//错误代码
#define DS_CO2_20_ERR_CMDFAIL				0x11
#define DS_CO2_20_ERR_RECFAIL				0x12

//命令长度
#define DS_CO2_20_LENTH_CMD  				7
//数据长度
#define DS_CO2_20_LENTH_DATA 				12

//=================接口函数声明=======================================
//=========================================================================
//函数名称：DS_CO2_20_init
//函数参数：无
//函数返回：无
//功能概要：初始化SET、RST、UART1（PTE0~1）引脚，发送状态信息给串口
//======================================================================
void DS_CO2_20_Init(void);

//=========================================================================
//函数名称：DS_CO2_20_control
//函数参数：cmd:控制命令
//函数返回：命令发送成功：0；命令发送失败：-1
//功能概要：通过命令控制传感器工作状态
//======================================================================
unsigned char DS_CO2_20_control(void);

//=========================================================================
//函数名称：DS_CO2_20_buildframe
//函数参数：cmd:控制命令
//		 *frame：命令帧数组
//函数返回：无
//功能概要：将命令组成命令帧
//======================================================================
void DS_CO2_20_buildframe(unsigned int cmd,unsigned char *frame);

//=========================================================================
//函数名称：DS_CO2_20_rest
//函数参数：无
//函数返回：无
//功能概要：通过RST引脚复位传感器
//======================================================================
void DS_CO2_20_rest(void);

//=========================================================================
//函数名称：DS_CO2_20_datarec
//函数参数：databuf:数据接收缓存
//函数返回：接收成功：0 ；接收失败： 0x12
//功能概要：接收传感器原始读数
//======================================================================
unsigned char DS_CO2_20_recdata(unsigned char *databuf);

//读取并处理
unsigned char DS_CO2_20_Read_Str(unsigned char *buf);
unsigned char DS_CO2_20_Read(unsigned char *buf);

#endif
