//======================================================================
//文件名称：PMS7003.h
//功能概要：空气颗粒物传感器（PM2.5）PM7003构件头文件
//制作单位：福建农林大学物联网与嵌入式实验室
//更新记录：2017-10-24 V1.0
//======================================================================

#ifndef _PMS7003_H
#define _PMS7003_H

#include <iocc2530.h>
#include <hal_uart.h>
#include <stdio.h>

//引脚定义
#define PMS7003_SET	P0_5
#define PMS7003_RST	P0_4
#define PMS7003_BAUD	9600

//命令定义
#define PMS7003_CMD_PSSTIVEREAD			(( 0xe2 <<8)|0)
#define PMS7003_CMD_READSTATE_PASSTIVE		(( 0xe1 <<8)|0)
#define PMS7003_CMD_READSTATE_ACTIVE		(( 0xe1 <<8)|1)
#define PMS7003_CMD_STANDBYMODE			(( 0xe4 <<8)|0)
#define PMS7003_CMD_NORMALMODE			(( 0xe4 <<8)|1)

//错误代码
#define PMS7003_ERR_CMDFAIL				0x11
#define PMS7003_ERR_RECFAIL				0x12

//命令长度
#define PMS7003_LENTH_CMD  				7
//数据长度
#define PMS7003_LENTH_DATA 				32

//=================接口函数声明=======================================
//=========================================================================
//函数名称：PMS7003_init
//函数参数：无
//函数返回：无
//功能概要：初始化SET、RST、UART1（PTE0~1）引脚，发送状态信息给串口
//======================================================================
void PMS7003_Init(void);

//=========================================================================
//函数名称：PMS7003_control
//函数参数：cmd:控制命令
//函数返回：命令发送成功：0；命令发送失败：-1
//功能概要：通过命令控制传感器工作状态
//======================================================================
unsigned char PMS7003_control(unsigned int cmd);

//=========================================================================
//函数名称：PMS7003_buildframe
//函数参数：cmd:控制命令
//		 *frame：命令帧数组
//函数返回：无
//功能概要：将命令组成命令帧
//======================================================================
void PMS7003_buildframe(unsigned int cmd,unsigned char *frame);

//=========================================================================
//函数名称：PMS7003_rest
//函数参数：无
//函数返回：无
//功能概要：通过RST引脚复位传感器
//======================================================================
void PMS7003_rest(void);

//=========================================================================
//函数名称：PMS7003_sleep
//函数参数：无
//函数返回：无
//功能概要：通过SET引脚休眠传感器
//======================================================================
void PMS7003_sleep(void);

//=========================================================================
//函数名称：PMS7003_datarec
//函数参数：databuf:数据接收缓存
//函数返回：接收成功：0 ；接收失败： 0x12
//功能概要：接收传感器原始读数
//======================================================================
unsigned char PMS7003_recdata(unsigned char *databuf);

//读取并处理
unsigned char PMS7003_Read_Str(unsigned char *buf);
unsigned char PMS7003_Read(unsigned char *buf);

#endif
